#include "../../app_debug_freertos/include/app_debug_freertos_tcb.h"

#include <stdint.h>
#include <string.h>
#include <stdio.h>
#include "cmsis_gcc.h"
#include "sdk_defs.h"
#include "FreeRTOS.h"
#include "task.h"
#include "portmacro.h"
#include "hw_hard_fault.h"
#include "hw_cpm.h"

#include "../../app_debug_freertos/include/adf_types.h"
#include "../../app_debug_freertos/include/adf_config.h"

#ifndef VERBOSE_HARDFAULT
#       define VERBOSE_HARDFAULT        0
#endif

#ifndef STATUS_BASE
#define STATUS_BASE (0x20005600)
#endif


#if dg_configENABLE_ADF


#define SYS_RAM_MAGIC_NUM               (0x01C28122)
#define RET_RAM_NEEDS_INITIALIZED(mn)   (mn != SYS_RAM_MAGIC_NUM)

#define SLOT_EMPTY                      (0x0000)
#define LAST_FRAME_MN                   (0xBADCOFEE)
#define ADF_MN                          (0xBAADBEBE)
#define FPU_CONTEXT_MASK                (0x10)
#define FOUR_BYTE_PADDING_MASK          (0x100)


#define IS_IN_RAM(x)                    (x > MEMORY_SYSRAM_BASE && x < MEMORY_SYSRAM_END)
#define IS_IN_FLASH(x)                  (x>0x200 && x <512*1024)
#define IS_VALID_ADDRESS(x)             (x & 0x01) && ( IS_IN_RAM(x) || IS_IN_FLASH(x) )
#define IN_FPU_CONTEXT(f)               (!(f & FPU_CONTEXT_MASK))
#define GET_STACK_ALIGN_BYTES(xPSR)     (xPSR & FOUR_BYTE_PADDING_MASK ? 4 : 0)

#define CMAC_IVT_SIZE                           (0xb4)
#define CMAC_STACK_VAL_IN_RANGE(x, cmi_end)     (x > CMAC_IVT_SIZE && x < cmi_end)
#define CMAC_ADDR_LINKED(x, cmi_end)            (CMAC_STACK_VAL_IN_RANGE(x, cmi_end)) && (x & 0x01)


typedef struct
{

        uint32_t                s16;
        uint32_t                s17;
        uint32_t                s18;
        uint32_t                s19;
        uint32_t                s20;
        uint32_t                s21;
        uint32_t                s22;
        uint32_t                s23;
        uint32_t                s24;
        uint32_t                s25;
        uint32_t                s26;
        uint32_t                s27;
        uint32_t                s28;
        uint32_t                s29;
        uint32_t                s30;
        uint32_t                s31;

}freertos_extended_frame_t;

typedef struct
{

        uint32_t                s0;
        uint32_t                s1;
        uint32_t                s2;
        uint32_t                s3;
        uint32_t                s4;
        uint32_t                s5;
        uint32_t                s6;
        uint32_t                s7;
        uint32_t                s8;
        uint32_t                s9;
        uint32_t                s10;
        uint32_t                s11;
        uint32_t                s12;
        uint32_t                s13;
        uint32_t                s14;
        uint32_t                s15;
        uint32_t                FPSCR;
        uint32_t                reserved;

}fpu_extended_frame_t;

typedef struct
{
        uint32_t                                r4;
        uint32_t                                r5;
        uint32_t                                r6;
        uint32_t                                r7;
        uint32_t                                r8;
        uint32_t                                r9;
        uint32_t                                r10;
        uint32_t                                r11;
        uint32_t                                exec_return;
        freertos_extended_frame_t               f_ext_frame;
        cortex_m_stack_frame_t                  frame;
        fpu_extended_frame_t                    ext_frame;

}m33_freetos_with_fpu_context_frame_t;

typedef struct
{
        uint32_t                        r4;
        uint32_t                        r5;
        uint32_t                        r6;
        uint32_t                        r7;
        uint32_t                        r8;
        uint32_t                        r9;
        uint32_t                        r10;
        uint32_t                        r11;
        uint32_t                        exec_return;
        cortex_m_stack_frame_t          frame;


}m33_freetos_no_fpu_context_frame_t;


typedef __PACKED_STRUCT
{
        // The SP when NMI_HandlerC() was called.
        //    (stacked_r8, .. , hf_stacked_psr)
        uint32_t stack_ptr;             // 0x0C

        // {r4 - r7} at time of crash
        uint32_t stacked_r8;            // 0x10
        uint32_t stacked_r9;            // 0x14
        uint32_t stacked_r10;           // 0x18
        uint32_t stacked_r11;           // 0x1C

        // {r8 - r11} at time of crash
        uint32_t stacked_r4;            // 0x20
        uint32_t stacked_r5;            // 0x24
        uint32_t stacked_r6;            // 0x28
        uint32_t stacked_r7;            // 0x2C

}cmac_additional_stacked_regs;


typedef __PACKED_STRUCT {
        uint32_t                        magic;                 // 0x00
        uint32_t                        magic_0;               // 0x04
        uint32_t                        magic_1;               // 0x08
        cmac_additional_stacked_regs    add_regs;

        cortex_m_stack_frame_t          nmi_stack_frame;
        cortex_m_stack_frame_t          hardfault_stack_frame;

} cmac_exception_t;


typedef __PACKED_STRUCT
{
        uint32_t mn;
        adf_last_frame_info_t last_stack_frame;
        tcb_info_t tcb_data[ADF_MAX_TRACKED_APP_TASKS];
}adf_info_t;


volatile        uint32_t        boot_ram_mn_val                      __SECTION_ADF_MAGIC

__RETAINED      bool                    s_start_tracking_tcbs;
__RETAINED      uint8_t                 s_num_tracked_tasks;
__RETAINED      void                    *s_task_tcbs[ADF_MAX_TRACKED_APP_TASKS];

__RETAINED_UNINIT adf_info_t            s_adf_info;
__RETAINED_UNINIT reset_reason_t        s_last_reset_reason;
__RETAINED_UNINIT cmac_event_info_t     s_cmac_error_event_data;


/**
\brief Get Link Register
\details Returns the current value of the Link Register (LR).
